<template lang="pug">
mixin kvRow(key)
  tr
    td= key
    td
      block

Layout
  section.section: .container: .content
    :remark
      # アミーゴについて
      ## ざっくり紹介
    .centering-container: img.image(src="@/assets/twitter-icon.png")
    table.table.is-striped
      tbody
        +kvRow('HN') アミーゴ
        +kvRow('Twitter') <a href="https://twitter.com/WL_Amigo">@WL_Amigo</a>
        +kvRow('GitHub') <a href="https://github.com/WL-Amigo">WL-Amigo</a>
        +kvRow('SoundCloud') <a href="https://soundcloud.com/amigo-whiteluckers">Amigo(WhiteLuckers)</a>
        +kvRow('専門にしようと思ってること') プログラミング、BGM制作
        +kvRow('趣味とか手を出してることとか') ゲーム、お絵描き、各種デザイン、電子工作、マイコン(arduino等)、グッズ・雑貨制作、映像制作・編集、企画、妄想
        +kvRow('好きなゲームのジャンル') RPG、アドベンチャー、謎解き
        +kvRow('反応する属性') 擬人化・ケモノ・ファンタジー・長髪・白髪(か薄い色の髪)・異形耳(エルフ耳、ケモノ耳など)・人外・デフォルメ・少女
        +kvRow('他の所属サークル') <a href="http://anedepami.sakura.ne.jp/">復旧アネデパミ</a>

    :remark
      ## もうちょっと詳しく
      ### アミーゴについて

      お読み頂きありがとうございます。WhiteLuckers 代表の アミーゴ と申します。

      上の紹介表で書いてある通り、なんか色んなことにひたすら手を出して、好きなように過ごしております。一応専門にしようと思っていることは「プログラミング」と「BGM制作」なのですが、それ以外のことにも相当時間を使っているため、専門になる気配がありません。寝てる時間も多いため、全然経験も増えません。 ~~つまりダメ人間~~

      トゲキッスが好きすぎて、サークル名とサークルロゴを決める時のきっかけにしたり、ステッカーを自分で作ってスマホケースに貼ったり、擬人化キャラを創ってみたり、DSiをトゲキッスっぽい柄にデコレーションしてみたり、なんかTwitterアイコンでトゲキッスっぽいパーカーみたいなのを着ていたり、トゲキッスの公式グッズを買い集めてみたりなど、トゲキッス好きを主張するべくなんか色々していますが、ポケモンにまつわる関係各社様とは何の関係もありません。しかしポケモンを生み出してくれた関係者様方には感謝しかありません。本当にありがとうございます(こんなところで書いても届かない)

      多分小学生ぐらいから「何か作る」ことに対して強い興味があり、また小さい頃からコンピュータを使える環境があったため、コンピュータが使える色んな作品制作に手を出してきました。今もたまに何か作っては報告をTwitterに流したりこのサイトに置いたりしています。作品への反応など頂けると大変嬉しいです。

      ### Twitter運用方針について

      個人のアカウントは、主に次のような内容をつぶやくと思われます。

      * 良いなと思ったサービス・ソフト・ライブラリ・製品の紹介
      * 作品の制作報告
      * ふと思ったこと
      * 独り言
          * 作品制作作業がつまると、知識があってもなくてもよくわからないことをつぶやき始めます
      * 愚痴
          * なるべくしないようにしていますが、流してしまったらごめんなさい
      
      また、次のような内容のツイートをRTすると思われます。

      * 良いなと思ったイラスト
      * 良いなと思ったサービス・ソフト・製品
      * 自分が共感した記事
      * 役に立つ知識を提供するもの
          * なるべくパクツイ・根拠なしの記事は弾くようにしていますが、確実に弾けていることは保証できません

      あまりつぶやかないため、RT中心にどうしてもなってしまうと思います。もしウザいようでしたら、最近は [RTだけを表示しないように出来ます](https://syncer.jp/twitter-how-to-hide-user-retweet) ので、ご活用頂ければと思います。もちろん、フォローして頂いた後でミュート・リムーブ・ブロックして頂くのは構いません(そんなこと元から自分がどうこう言える話ではないですが、一応)。

      リプライは反応したりしなかったりですが、基本的には全て読んでおります(そんな数来ませんし)。ただ、確実に伝えたい内容の場合は、Twitterの場合はDMの方が良いと思われます(DMも時折返事が遅れたりするのですが…)。

      「フォローバック」は基本的にしておりません。フォロワー増やしのためのフォローは何だか寂しくなりますのでご遠慮頂ければ幸いです。

      たまに1ヶ月ぐらいつぶやかなくなったりしますが、多分生きているので大丈夫です。

      こんなテキトーな感じですが、もしご興味を持って頂けたらフォローして頂けると大変嬉しいです。


        

      
</template>

<script>
export default {
  metaInfo: {
    title: 'アミーゴについて'
  }
}
</script>
